### .merge - Inner, Left, Right, and Full Outer Joins
#### Pandas - Tips and Tricks 

<br></br>
Previous post:  
[df.loc, df.iloc](http://codewithmax.com/2018/02/27/pandas-tips-and-tricks-df-loc-df-iloc/) - [nbviewer](http://nbviewer.jupyter.org/github/ditdili/Python_Tutorials/blob/master/notebooks/Pandas-Tips_and_Tricks-loc-iloc.ipynb)  

This notebook is a part of __Pandas - Tips and Tricks__ mini-series, focusing on different aspects of __pandas__ library in __Python__. In the below examples we will be looking at implementation of Inner, Left, Right, and Full Outer joins using __.merge__ method.

More on __.merge__ on pandas [documentation](http://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.DataFrame.merge.html).

Let's start by importing __pandas__:

In [1]:
# Loading pandas and checking the version
import pandas as pd
print("Version:", pd.__version__)

Version: 0.21.0

<br></br>
Let's create the tables manually with the below data. I am using Python dictionaries, and then converting them to pandas DataFrames:

In [2]:
# Dictionary holding customer information
customers = [{'Cust_Id' : 1, 'Cust_Name' : 'Ben Peters',  'City_Id' : 1},
             {'Cust_Id' : 2, 'Cust_Name' : 'Mike Avery',  'City_Id' : 2},
             {'Cust_Id' : 3, 'Cust_Name' : 'Mary Avery',  'City_Id' : 2},
             {'Cust_Id' : 4, 'Cust_Name' : 'Susan Hanna', 'City_Id' : None},
             {'Cust_Id' : 5, 'Cust_Name' : 'John Smith',  'City_Id' : 3}
            ]

# Dictionary holding city information
cities = [{'City_Id' : 1, 'City_Name' : 'Dallas'},
          {'City_Id' : 2, 'City_Name' : 'Houston'},
          {'City_Id' : 3, 'City_Name' : 'Austin'},
          {'City_Id' : 4, 'City_Name' : 'San Antonio'}
         ]

# Creating pandas DataFrames from the given dictionaries
cust_df = pd.DataFrame(customers)
city_df = pd.DataFrame(cities)

In [3]:
# Checking the new DataFrame
cust_df

   City_Id  Cust_Id    Cust_Name
0      1.0        1   Ben Peters
1      2.0        2   Mike Avery
2      2.0        3   Mary Avery
3      NaN        4  Susan Hanna
4      3.0        5   John Smith

In [4]:
# Checking the new DataFrame
city_df

   City_Id    City_Name
0        1       Dallas
1        2      Houston
2        3       Austin
3        4  San Antonio

### Inner Join

In [5]:
pd.merge(cust_df, city_df, on=['City_Id'])

  City_Id  Cust_Id   Cust_Name City_Name
0       1        1  Ben Peters    Dallas
1       2        2  Mike Avery   Houston
2       2        3  Mary Avery   Houston
3       3        5  John Smith    Austin

### Left Outer Join

In [6]:
pd.merge(cust_df, city_df, how='left', on=['City_Id'])

  City_Id  Cust_Id    Cust_Name City_Name
0       1        1   Ben Peters    Dallas
1       2        2   Mike Avery   Houston
2       2        3   Mary Avery   Houston
3     NaN        4  Susan Hanna       NaN
4       3        5   John Smith    Austin

### Right Outer Join

In [7]:
pd.merge(cust_df, city_df, how='right', on=['City_Id'])

   City_Id  Cust_Id   Cust_Name    City_Name
0      1.0      1.0  Ben Peters       Dallas
1      2.0      2.0  Mike Avery      Houston
2      2.0      3.0  Mary Avery      Houston
3      3.0      5.0  John Smith       Austin
4      4.0      NaN         NaN  San Antonio

### Full Outer Join

In [8]:
pd.merge(cust_df, city_df, how='outer', on=['City_Id'])

   City_Id  Cust_Id    Cust_Name    City_Name
0      1.0      1.0   Ben Peters       Dallas
1      2.0      2.0   Mike Avery      Houston
2      2.0      3.0   Mary Avery      Houston
3      NaN      4.0  Susan Hanna          NaN
4      3.0      5.0   John Smith       Austin
5      4.0      NaN          NaN  San Antonio